{"weightsManifest": [{"paths": ["group1-shard1of25.bin", "group1-shard2of25.bin", "group1-shard3of25.bin", "group1-shard4of25.bin", "group1-shard5of25.bin", "group1-shard6of25.bin", "group1-shard7of25.bin", "group1-shard8of25.bin", "group1-shard9of25.bin", "group1-shard10of25.bin", "group1-shard11of25.bin", "group1-shard12of25.bin", "group1-shard13of25.bin", "group1-shard14of25.bin", "group1-shard15of25.bin", "group1-shard16of25.bin", "group1-shard17of25.bin", "group1-shard18of25.bin", "group1-shard19of25.bin", "group1-shard20of25.bin", "group1-shard21of25.bin", "group1-shard22of25.bin", "group1-shard23of25.bin", "group1-shard24of25.bin", "group1-shard25of25.bin"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 64], "name": "conv1_1/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv1_1/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv1_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv1_2/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 128], "name": "conv2_1/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2_1/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2_2/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2_2/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 256], "name": "conv3_1/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv3_1/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "conv3_2/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv3_2/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "conv3_3/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv3_3/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 512], "name": "conv4_1/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv4_1/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv4_2/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv4_2/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv4_3/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv4_3/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv5_1/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv5_1/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv5_2/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv5_2/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv5_3/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv5_3/bias"}, {"dtype": "float32", "shape": [512, 1024], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [1024], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [1024, 2048], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [2048], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [2048, 4096], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [4096], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [4096, 2], "name": "dense_4/kernel"}, {"dtype": "float32", "shape": [2], "name": "dense_4/bias"}]}], "modelTopology": {"training_config": {"metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "lr": 9.999999747378752e-05, "momentum": 0.8999999761581421, "decay": 0.0}}, "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.0.8", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 100, 100, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv1_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv1_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv1_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv1_2", 0, 0, {}]]], "config": {"name": "pool1", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "pool1"}, {"class_name": "Conv2D", "inbound_nodes": [[["pool1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2_2", 0, 0, {}]]], "config": {"name": "pool2", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "pool2"}, {"class_name": "Conv2D", "inbound_nodes": [[["pool2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv3_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv3_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv3_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv3_3", 0, 0, {}]]], "config": {"name": "pool3", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "pool3"}, {"class_name": "Conv2D", "inbound_nodes": [[["pool3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv4_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv4_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv4_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv4_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv4_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv4_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv4_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv4_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv4_3", 0, 0, {}]]], "config": {"name": "pool4", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "pool4"}, {"class_name": "Conv2D", "inbound_nodes": [[["pool4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv5_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv5_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv5_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv5_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv5_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv5_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv5_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv5_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv5_3", 0, 0, {}]]], "config": {"name": "pool5", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "pool5"}, {"class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["pool5", 0, 0, {}]]], "config": {"trainable": false, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "name": "global_average_pooling2d_1"}, {"class_name": "Dense", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "use_bias": true, "activity_regularizer": null}, "name": "dense_1"}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2048, "use_bias": true, "activity_regularizer": null}, "name": "dense_2"}, {"class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4096, "use_bias": true, "activity_regularizer": null}, "name": "dense_3"}, {"class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "name": "dense_4"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_4", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.0.8", "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "layers-model"}